Revit 2027 API
ParameterTypeId.MakeSurfaceFromClosedLoops Property
 "Make surface from closed loops"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MakeSurfaceFromClosedLoops { get; }
Public Shared ReadOnly Property MakeSurfaceFromClosedLoops As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MakeSurfaceFromClosedLoops {
	ForgeTypeId^ get ();
}
static member MakeSurfaceFromClosedLoops : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace